{
    "cohort": [
        {
            "id": 1,
            "firstName": "Allison",
            "lastName": "Patton",
            "reelThemIn": "<p>I believe in hard work and luck, and that the first often leads to the second.<br>- J.K. Rowling<p>",
            "bio": "<p>I am an organized web developer who went from utilizing web applications that could help clients speak, to wanting to code them. Formerly as a Speech Language Pathologist, it was my job to diagnose language disorders and devise a plan to help the client access the correct syntax to get their message across. Many of the clients I worked with were non-verbal and required some form of technology to communicate. I had a blast tackling the intricate challenges of configuring apps to specific users in order to teach them to communicate by text to speech buttons.</p>",
            "github": "https://github.com/Alpttn",
            "linkedIn": "https://www.linkedin.com/in/allisonpttn",
            "portfolio": "https://alpttn.github.io/allison-patton",
            "email": "allison.tpttn@gmail.com",
            "proImg": "AllisonPatton.jpg",
            "funImg": "AllisonPatton_Fun.jpg",
            "isHired": false
        },
        {
            "id": 2,
            "firstName": "Bennett",
            "lastName": "Foster",
            "reelThemIn": "A ship in port is safe, but that's not what ships are built for. <br>- Grace Hopper",
            "bio": "<p>I come to software development from a background in philosophy and education. Teaching at both the middle school and university levels afforded me great experience in leadership, collaboration and team building. Ultimately, I've decided to pursue software development to leverage my practical, creative and intellectual skills and interests. My love of learning and problem solving, along with my fascination with language and logic, have prepared me well for a career in a field that is always changing and expanding in new, exciting ways.</p>",
            "github": "https://github.com/bennfos",
            "linkedIn": "https://www.linkedin.com/in/bennett-foster",
            "portfolio": "https://bennfos.github.io/bennett-foster",
            "email": "bennfos@gmail.com",
            "proImg": "BennettFoster.jpg",
            "funImg": "BennettFoster_Fun.jpg",
            "isHired": false
        },
        {
            "id": 3,
            "firstName": "Bobby",
            "lastName": "Brady",
            "reelThemIn": "You miss 100% of the shots you don't take.<br>- Michael Scott",
            "bio": "<p>The power of modern computers has always fascinated me. From the old desktops I used in elementary school, to the powerful handheld smart phones of today; computers truly are magical. I first experienced writing code while in the US Navy. While simple, the code my platoon wrote helped guide Unmanned Underwater Vehicles to locate mines in the ocean. The power of this technology had me asking questions and the Nashville Software School has been there to provide answers. I look forward to my career as a Software Developer.</p>",
            "github": "https://github.com/bobbybrady",
            "linkedIn": "https://www.linkedin.com/in/bobbybrady/",
            "portfolio": "",
            "email": "bbrady91@gmail.com",
            "proImg": "BobbyBrady.jpg",
            "funImg": "BobbyBrady_Fun.jpg",
            "isHired": false
        },
        {
            "id": 4,
            "firstName": "Brantley",
            "lastName": "Jones",
            "reelThemIn": "I have waited a long time for this moment, my little green friend.<br>- Sheev Palpatine",
            "bio": "Before software development I was a fisheries biologist managing small impoundments and recreational fish populations. My interest in being a developer started when I took an online course learning HTML and CSS. My favorite aspects about software development are the continuous learning, being able to build something from scratch, and tinker with something that already exists.",
            "email": "brantleyjones74@gmail.com",
            "github": "https://github.com/brantleyjones74",
            "linkedIn": "https://www.linkedin.com/in/brantleyjones74",
            "portfolio": "",
            "proImg": "BrantleyJones.jpg",
            "funImg": "BrantleyJones_Fun.jpg",
            "isHired": false
        },
        {
            "id": 5,
            "firstName": "Brian",
            "lastName": "Wilson",
            "reelThemIn": "\"[object Object]\"",
            "bio": "<p>Prior to software development I was in the world of video editing and production. Fresh out of college I moved to Los Angeles to attempt to break into show business as a screenwriter. But like so many others, I never was able to sell a script.  Ultimately I fell in love with editing and moved back to Nashville and began my career as a video editor.  Over the years I've edited countless television shows, music videos, television commercials, and corporate and non-profit films. The last 8 years of my career I began shooting and editing various projects for non-profits both in Tennessee and out of state. Software development has always intrigued me and yearning for more stability and a new challenge, I have decided to make a change. I find that there are similar skills that are required in both video editing and developing. We are constantly trying to solve problems that arise and are under the demands of a timeline. I have spent years making clients happy and delivering their projects to them on time. This experience will be just as important in the world of web development.</p>",
            "github": "https://github.com/veloeditor",
            "linkedIn": "https://www.linkedin.com/in/brianwilsondev",
            "portfolio": "https://veloeditor.github.io/portfolio",
            "email": "wilsonedit@gmail.com",
            "proImg": "BrianWilson.jpg",
            "funImg": "BrianWilson_Fun.jpg",
            "isHired": false
        },
        {
            "id": 6,
            "firstName": "Carl",
            "lastName": "Barringer",
            "reelThemIn": "There is no place like 127.0.0.1",
            "bio": "<p>I have been interested in technology for many years and have had the opportunity to work in technology related to companies and roles. In the past I have written code for some personal websites and microcontroller projects. I have also written some scripting code for clinical reports and Salesforce reports. My roles in previous companies have tended to be more focused on client facing responsibilities such as a sales engineer and marketing management. During this time, I have always been drawn to the technology side of the business. Recently I have had the opportunity and time to dive deeper into technology and learning to code. I began learning and coding by utilizing Codecademy and Treehouse. I also began attending some code and technology related MeetUps in the Nashville area. It was at this time that I learned about the Nashville Software School. I am fascinated by coding and increasingly passionate about the idea of solving problems with technology.</p>",
            "github": "https://github.com/cbarr123",
            "linkedIn": "https://www.linkedin.com/in/carlbarringer",
            "portfolio": "http://www.ecbarringer.com",
            "email": "carl@ecbarringer.com",
            "proImg": "CarlBarringer.jpg",
            "funImg": "CarlBarringer_Fun.jpg",
            "isHired": false
        },
        {
            "id": 7,
            "firstName": "Curtis",
            "lastName": "Crutchfield",
            "reelThemIn": "It's the questions we can't answer that teach us the most. They teach us how to think. If you give a man an answer, all he gains is a little fact. But give him a question and he'll look for his own answers.<br>- Patrick Rothfuss",
            "bio": "<p>I am currently pursing my life-long dream of becoming a computer programmer by furthering my education at Nashville Software School (NSS). At the age of 16, I attempted to build my first game with a book called Visual Basics Studios for Teenagers, and my passion evolved from there. NSS is providing me with the opportunity to achieve my goal of becoming a computer programmer.</p>",
            "github": "https://github.com/land0o",
            "linkedIn": "https://www.linkedin.com/in/curtis-crutchfield",
            "portfolio": "http://www.curtiscrutchfield.com",
            "email": "crutchc@yahoo.com",
            "proImg": "CurtisCrutchfield.jpg",
            "funImg": "CurtisCrutchfield_Fun.jpg",
            "isHired": false
        },
        {
            "id": 8,
            "firstName": "Ellie",
            "lastName": "Ash",
            "reelThemIn": "People will never be replaced by machines. In the end, life and business are about human connections. And computers are about trying to murder you in a lake. And to me, the choice is easy.<br>- Michael Scott",
            "bio": "<p>I discovered my passion for coding in high school when I began digging into the code behind my art blog. I was able to use my background in visual arts in a new medium - I wasn't just creating something to be viewed, but something that people could interact with. I became fascinated with the philosophy behind programming and its unique imprint on reality. I was excited by the tech community and the opportunity to learn from others, and I became passionate about coding with other developers and users in mind. This lead me to enroll at Nashville Software School, a place that provided me with the most meaningful learning experience I have ever had. I learned about code; but more importantly, I learned HOW to learn about code. I now consider myself a lifelong student and I view every challenge as a new opportunity to grow.</p>",
            "github": "https://github.com/Ellie-Ash",
            "linkedIn": "https://www.linkedin.com/in/Ellie-Ash",
            "portfolio": "",
            "email": "",
            "proImg": "EllieAsh.jpg",
            "funImg": "EllieAsh_Fun.jpg",
            "isHired": false
        },
        {
            "id": 9,
            "firstName": "Eric",
            "lastName": "Taylor",
            "reelThemIn": "Claire likes to say, \"You can be part of the problem or you can be part of the solution.\" But I happen to believe you can be both.<br>- Phil Dunphy",
            "bio": "<p>My passion for software development began well before I even considered computer programming and software development as something I could use to solve problems I have noticed or experienced on some level in my life and 20-year employment history. As an insurance agent and an owner of my own social media marketing business, I consistently found myself loving the process of solving problems. The greatest frustration I have experienced professionally in that time has been the lack of tools at my disposal to effectively solve problems that would arise in a given day. One recurring problem is the dilemma that seems to plague so many offices in the corporate world; making the choice of being in compliance with all rules and regulations or being productive. I refuse to believe these two very vital components of a successful business cannot co-exist. The solution to this, and the other various problems I would love to attempt solving can be found within the walls of the Software Development hemisphere.</p>",
            "github": "https://github.com/ericfromspringfield1",
            "linkedIn": "https://www.linkedin.com/in/erictaylor2019",
            "portfolio": "",
            "email": "ericfromspringfield@gmail.com",
            "proImg": "EricTaylor.jpg",
            "funImg": "EricTaylor_Fun.jpg",
            "isHired": false
        },
        {
            "id": 10,
            "firstName": "Haroon",
            "lastName": "Iqbal",
            "reelThemIn": "Doing the same thing over and over again and expecting different results is the definition of software development.<br>- Andy Collins",
            "bio": "<p>I am an attorney by training and have spent the last five years working for state government. In my position, I worked both with IT professionals and on my own to create solutions for managing data more effectively. My work on these projects prompted an interest in software development, which led me to Nashville Software School. I am interested in using code to make web applications that can increase the ease and efficiency of completing complex tasks while improving the overall user experience.</p>",
            "github": "https://github.com/haroonsiqbal",
            "linkedIn": "https://www.linkedin.com/in/haroonsiqbal",
            "portfolio": "https://haroonsiqbal.github.io/website",
            "email": "haroonsiqbal@gmail.com",
            "proImg": "HaroonIqbal.jpg",
            "funImg": "HaroonIqbal_Fun.jpg",
            "isHired": false
        },
        {
            "id": 11,
            "firstName": "Jacquelyn",
            "lastName": "McCray",
            "reelThemIn": "One can remain alive long past the usual date of disintegration if one is unafraid of change, insatiable in intellectual curiosity, interested in big things, and happy in small ways.<br>- Lemony Snicket",
            "bio": "<p>Spending nearly five years in civil engineering and construction management taught me a lot about creative problem solving, analytical thinking, and working with a wide variety of teams. I experienced the way software boosted efficiency and collaboration among my team, and I found that I enjoyed learning everything I could about technology. Taking the plunge to alter my career path was the logical next step, and I continue to love learning new skills, languages, and technologies. I've contributed to the Music City skyline, and now I can't wait to contribute to Nashville's thriving tech community.</p>",
            "github": "https://github.com/jkmccray",
            "linkedIn": "https://www.linkedin.com/in/jacquelynmccray",
            "portfolio": "https://jacquelynmccray.com",
            "email": "jacquelynkmccray@gmail.com",
            "proImg": "JacquelynMcCray.jpg",
            "funImg": "JacquelynMcCray_Fun.jpg",
            "isHired": false
        },
        {
            "id": 12,
            "firstName": "Joe",
            "lastName": "Snyder",
            "reelThemIn": "If people knew how hard I had to work to gain my mastery, it would not seem so wonderful at all.<br>– Michelangelo",
            "bio": "<p>After gaining experience in a variety of roles, including the military and the financial industry, I became increasingly curious about how I could leverage technology to improve the capabilities and efficiency of individuals and teams. I'm passionate about learning and enjoy brainstorming solutions to challenging problems. I began to realize that a career in software development would allow me to further explore my interest in technology while taking advantage of my analytical, process-oriented mindset and experience in team-oriented environments.</p>",
            "github": "https://github.com/snyderjd",
            "linkedIn": "https://www.linkedin.com/in/joe-snyder",
            "portfolio": "https://snyderjd.github.io/joe-snyder",
            "email": "snyderjosephd@yahoo.com",
            "proImg": "JoeSnyder.jpg",
            "funImg": "JoeSnyder_Fun.jpg",
            "isHired": false
        },
        {
            "id": 13,
            "firstName": "Kelly",
            "lastName": "Coles",
            "reelThemIn": "All life deserves respect, dignity, and compassion. All life.<br>- Anonymous",
            "bio": "<p>I was introduced to coding while pursuing a degree in Visual Communications. The first time I saw my code become reality in a browser, I knew the path I wanted to take, and I changed majors. The more I learned about the problem-solving aspect of coding, the happier I was about my decision. I’m still passionate about design, but software development intrigues me because I love to be challenged, solve problems, and build things. Nothing is more satisfying (and challenging) than having an idea and turning it into a functioning piece of software that will somehow make someone’s life a little easier.</p>",
            "github": "https://github.com/kellycoles",
            "linkedIn": "https://www.linkedin.com/in/kelly-coles1",
            "portfolio": "https://kellycoles.github.io",
            "email": "kellycoles1@gmail.com",
            "proImg": "KellyColes.jpg",
            "funImg": "KellyColes_Fun.jpg",
            "isHired": false
        },
        {
            "id": 14,
            "firstName": "Kevin",
            "lastName": "Sadler",
            "reelThemIn": "Life's a Garden. Dig it.<br>- Joe Dirt",
            "bio": "<p>After working several jobs in different fields, learning new trades and sometimes even traveling for work, I was still in search of the right career for me. I needed something that I felt good about devoting my time to; a career that allowed me to problem solve, constantly challenged me to learn, and had no limits to how far I could take it. Luckily, I found that career with software development.</p>",
            "github": "https://github.com/KevinSadler",
            "linkedIn": "www.linkedin.com/in/kevin-sadler",
            "portfolio": "",
            "email": "sadlerkev94@gmail.com",
            "proImg": "KevinSadler.jpg",
            "funImg": "KevinSadler_Fun.jpg",
            "isHired": false
        },
        {
            "id": 15,
            "firstName": "Maggie",
            "lastName": "Johnson",
            "reelThemIn": "Everything is beautiful in this world except terrible things.<br>- Andy Collins",
            "bio": "<p>My path to a career in web development has been non-traditional to say the least. For the past several years, I have been a dedicated operations manager with expertise in fulfillment and supply chain. After a lot of introspection, I decided to enroll at Nashville Software School with hopes of finding a more fulfilling career.</p><p>When I tell people I'm working towards a career as a web developer, most consider it a complete one-eighty from my previous jobs, but I have never seen it that way. For me, this is a natural progression based on my passions: learning, continuous improvement, helping others, and ultimately leaving things better than I found them. When I really think about it, all of my previous roles have prepared me for exactly where I am now. I've spent the last 7 years working at startups. There are unique challenges working for a company that is doing something completely new. There is no beaten path to follow. It is up to you to find creative solutions to solve complex problems. You can't be afraid to try things, and more importantly, you can't be afraid to fail.</p><p>Coding is no different. In my time at NSS so far, I've found that the lessons I learned in my previous positions have translated well to the classroom. What excites me most about this process is knowing that it will not only help me grow professionally, but afford me the opportunity to use my creativity to bring my vision for a more inclusive world to life.</p>",
            "github": "https://github.com/mmjohn09",
            "linkedIn": "https://www.linkedin.com/in/mj-dev",
            "portfolio": "",
            "email": "mmjohn09@icloud.com",
            "proImg": "MaggieJohnson.jpg",
            "funImg": "MaggieJohnson_Fun.jpg",
            "isHired": false
        },
        {
            "id": 16,
            "firstName": "Matthew",
            "lastName": "Ross",
            "reelThemIn": "I'm not uncrafty. - Jögge Sundqvist",
            "bio": "<p>I've always been easily fascinated and intensely curious - I want to understand. As a Chaplain, these skills served me well in the work of helping others find healing and meaningful connection in their relationships with other people and with themselves. I also love to create. I love to build things, to tinker, to figure out how things are working, and how to repair them when they’re busted. I was drawn to software development after a friend gave me an Arduino he had laying around. I managed to write enough code to control a small DC motor, and have been hooked ever since. I am energized by the unending opportunity to be creative, to continually learn new things and technologies, and to build things that serve to connect and help people.</p>",
            "github": "https://github.com/spuuun",
            "linkedIn": "https://www.linkedin.com/in/matt-doug-ross",
            "portfolio": "https://spuuun.github.io/portfolio-site",
            "email": "matthew.douglas.ross@gmail.com",
            "proImg": "MatthewRoss.jpg",
            "funImg": "MatthewRoss_Fun.jpg",
            "isHired": false
        },
        {
            "id": 17,
            "firstName": "Michael",
            "lastName": "Stiles",
            "reelThemIn": "Great job, everyone. The reception will be held in each of our individual houses, alone.<br>- Ron Swanson",
            "bio": "<p>Having experience in production-line, IT, and management I have been able to see many sides of the business world. From seeing a design go from a sketch to a physical product, Diving into a customers network to find the right product to compliment their existing environment, or being in a management role to help meet goals and deadlines.</p><p>Dealing with different business cultures has helped me realize that communication is the number one key to success, I have been privileged to be able to have been on teams that challenge me to grow my communication between departments that seem worlds apart.</p><p>The diversity of portfolio has allowed me to appreciate how complex it is to operate a business, and realize that there are no static pieces when it comes to making a business a finely tuned machine.</p><p>I have decided to concentrate my career path into Software Development. After moving to Nashville, I began to see the endless possibilities that the Software Development field had to offer. After much research I found Nashville Software School, and am currently enrolled. Being apart of Cohort 34 has been the most rewarding and challenging thing I have done thus far, and I am hopeful to give back to the community.</p><p>I have learned through the years that nothing is given to you, and success doesn't just fall into your lap. I have adopted the anecdote, \"To win the lottery, you have to make enough money to buy the ticket,\" as my personal motto.</p>",
            "github": "https://github.com/mstiles01",
            "linkedIn": "https://www.linkedin.com/in/mstiles01",
            "portfolio": "",
            "email": "mstiles01@icloud.com",
            "proImg": "MichaelStiles.jpg",
            "funImg": "MichaelStiles_Fun.jpg",
            "isHired": false
        },
        {
            "id": 18,
            "firstName": "Michelle",
            "lastName": "Jimenez",
            "reelThemIn": "A wise man once said nothing.",
            "bio": "<p>On my 19th birthday I was given my very first Rubik's cube puzzle. I grabbed it and instantly began solving it. I worked at it non-stop for hours without any breaks. I was obsessed with it. After completing it, I realized how much time had gone by without a care in the world. I remember wishing work was like that. The lesson I learned from the puzzle was that I enjoy thinking and solving problems. If I could find a job where I could think and solve problems, work would fly by and I would enjoy myself. I contemplated for some time and decided to look into programming. Programming was a perfect fit for this passion I had found within myself. I began teaching myself how to program software, and even though it was very difficult at first, I became decent enough to begin thinking about a career in software development. This led me to Nashville Software School. The time I’ve spent building software and web applications, have been some of the most rewarding and enjoyable times of my life.</p>",
            "github": "https://github.com/mjimeneztn",
            "linkedIn": "https://www.linkedin.com/in/michellezjimenez",
            "portfolio": "",
            "email": "mjimeneztn@gmail.com",
            "proImg": "MichelleJimenez.jpg",
            "funImg": "MichelleJimenez_Fun.jpg",
            "isHired": false
        },
        {
            "id": 19,
            "firstName": "Noah",
            "lastName": "Bartfield",
            "reelThemIn": "There’s nothing more exciting than science. You get all the fun of sitting still, being quiet, writing down numbers, paying attention. Science has it all.<br>- Seymour Skinner",
            "bio": "<p>For most of my life I have focused my energy and creativity on a career in music. In the years since college, my life has been filled with exciting moments as well as moments of questioning whether the up and down nature of a career in music was best for me. I had heard positive rumblings about Nashville Software School and decided to make the leap. What immediately drew me to software development was the focus on continual learning and growth. This spoke to my curiosity. What then captured me further was similar to what I have always loved about music - there is nothing more fulfilling than making something out of nothing. I am proud to consider myself a software developer and am thankful for the path that brought me here.</p>",
            "github": "https://github.com/noahbartfield",
            "linkedIn": "https://www.linkedin.com/in/noahbartfield",
            "portfolio": "https://noahbartfield.github.io/personal-website",
            "email": "noahbartfield@gmail.com",
            "proImg": "NoahBartfield.jpg",
            "funImg": "NoahBartfield_Fun.jpg",
            "isHired": false
        },
        {
            "id": 20,
            "firstName": "Sarah",
            "lastName": "Fleming",
            "reelThemIn": "Write your code like the person coming behind you is a psychopath who knows your home address. And usually, that psycopath is you.<br>- Andy Collins",
            "bio": "<p>A volunteer opportunity at a crisis center exposed me to 2-1-1, a helpline that connects people to local health and human service providers, which is where I worked on my first web application. Staff were using an outdated tool to prescreen clients for SNAP/Food Stamps because there was no one to update the code.</p><p>I spent the next few weeks reviewing the code and learning enough PHP and JavaScript to understand and modify it. I had to build in new logic to capture changes in the eligibility guidelines and decided to add better instructions for end users.</p><p>The sense of accomplishment I felt once I completed it was amazing. That tool is still in use seven years and about 14 revisions later. That project sparked my interest in software development. At NSS I discovered that using my technical skills to make life just a little bit better for people is my true passion.</p>",
            "github": "https://github.com/sarahkfleming",
            "linkedIn": "https://www.linkedin.com/in/sarah-k-fleming",
            "portfolio": "",
            "email": "sarah.k.fleming@gmail.com",
            "proImg": "SarahFleming.jpg",
            "funImg": "SarahFleming_Fun.jpg",
            "isHired": false
        },
        {
            "id": 21,
            "firstName": "William",
            "lastName": "Wilkinson",
            "reelThemIn": "All we have to decide is what to do with the time that is given to us.<br>- J.R.R. Tolkein",
            "bio": "<p>Tinkering with technology has been a passion of mine since I was a kid. It started with upgrading RAM in my computer, and evolved into building my own PC's in college. After six successful years selling SaaS at ADP and insurance at Brown & Brown I found web development through a contact of mine, and immediately started learning everything I could on various websites like Udemy, Freecodecamp and SoloLearn. I fell in love with coding after a year of learning and building my own projects and decided to solidify my education at Nashville Software School. During my education so far, I've learned not just about coding, but also what it takes to work with a team of developers to build a functional product.</p>",
            "github": "https://github.com/wilkinson4",
            "linkedIn": "https://www.linkedin.com/in/will-wilkinson",
            "portfolio": "http://www.will-wilkinson.com",
            "email": "wfw40869@gmail.com",
            "proImg": "WilliamWilkinson.jpg",
            "funImg": "WilliamWilkinson_Fun.jpg",
            "isHired": false
        }

    ]
}
